## Books (Core) Assignment

### Data structure

 ![png](books_erd.png)

### Imports

In [1]:
import pandas as pd
import pymysql
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

### Setup

In [2]:
pymysql.install_as_MySQLdb()

## Create connection
username = "root"
password = "root"
db_name = "books"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

In [3]:
## Create engine
engine = create_engine(connection)

In [4]:
## Create database

if database_exists(connection) == False:
  create_database(connection)
else:
  print('The database already exists')

The database already exists

In [5]:
## Verify database exists
database_exists(connection)

True

In [6]:
df_users = pd.read_csv('Data/users.csv')
df_users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [7]:
df_users.to_sql('users', engine, if_exists = 'replace')

3

In [8]:
df_books = pd.read_csv('Data/books.csv')
df_books.head()

,First Name,Last Name,Email,Book Title,Book Author
0,John,Doe,JD@books.com,The Shining,Stephen King
1,John,Doe,JD@books.com,It,Stephen King
2,John,Doe,JD@books.com,The Great Gatsby,F. Scott Fitzgerald
3,Robin,Smith,Robin@books.com,The Call of the Wild,Jack London
4,Robin,Smith,Robin@books.com,Pride and Prejudice,Jane Austen

In [9]:
## Add id column
df_books['id'] = range(1, len(df_books) + 1)

## Rename columns
names = {'First Name': 'first_name', 'Last Name': 'last_name', 'Email': 'email', 'Book Title': 'title', 'Book Author': 'author', 'id': 'id'}
df_books.rename(columns = names, inplace = True)

df_books.head()

,first_name,last_name,email,title,author,id
0,John,Doe,JD@books.com,The Shining,Stephen King,1
1,John,Doe,JD@books.com,It,Stephen King,2
2,John,Doe,JD@books.com,The Great Gatsby,F. Scott Fitzgerald,3
3,Robin,Smith,Robin@books.com,The Call of the Wild,Jack London,4
4,Robin,Smith,Robin@books.com,Pride and Prejudice,Jane Austen,5

In [10]:
df_books.to_sql('books', engine, if_exists = 'replace')

7

In [11]:
df_authors = pd.read_csv('Data/authors.csv')
df_authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [12]:
df_authors.to_sql('authors', engine, if_exists = 'replace')

5

In [13]:
df_fav = pd.read_csv('Data/favorites.csv')
df_fav.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [14]:
df_fav.to_sql('favorites', engine, if_exists = 'replace')

7

In [15]:
q_1 = """SHOW TABLES;"""
pd.read_sql(q_1, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [16]:
q_2 = """
SELECT
    books.title
FROM
    books
JOIN
    favorites ON books.id = favorites.book_id
WHERE
    favorites.user_id = 
    (SELECT
        users.id
    FROM
        users
    WHERE
        (users.last_name = 'Doe' AND users.first_name = 'John'))
;"""
pd.read_sql(q_2, engine)

              title
0       The Shining
1                It
2  The Great Gatsby